tap "asmvik/formulae"
tap "bengerthelorf/tap", "https://github.com/Bengerthelorf/homebrew-tap"
tap "browsh-org/browsh"
tap "hamed-elfayome/claude-usage"
tap "jakehilborn/jakehilborn"
tap "mhaeuser/mhaeuser"
tap "msitarzewski/brew-browser"
tap "sandreas/tap"
tap "sho0pi/tap"
tap "sozercan/repo"
tap "supabase/tap"
tap "xykong/tap"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# Access VS Code through the browser
brew "code-server", restart_service: :changed
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Tool to install, manage and use Progressive Web Apps in Mozilla Firefox
brew "firefoxpwa"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Lets you manipulate the signature block in a Mach-O binary
brew "ldid"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Deep clean and optimize your Mac
brew "mole"
# Fast, highly customisable system info script
brew "neofetch"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Command-line interface for 1Password
cask "1password-cli"
# Control the platform power state of your Apple Silicon device
cask "mhaeuser/mhaeuser/battery-toolkit"
# Native GUI for Homebrew
cask "msitarzewski/brew-browser/brew-browser"
# Native macOS menu bar app for monitoring Claude AI usage limits
cask "hamed-elfayome/claude-usage/claude-usage-tracker"
# Beautiful Markdown previews in macOS Finder QuickLook
cask "xykong/tap/flux-markdown"
cask "font-atkinson-hyperlegible-mono"
# Customize macOS app icons
cask "bengerthelorf/tap/iconchanger", trusted: true
# Voice-to-text transcription and paste tool
cask "kitlangton-hex"
# Adaptive brightness for external displays
cask "lunar"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Menu bar manager
cask "thaw"
uv "claude-monitor"
uv "perplexity-web-mcp-cli"
uv "pirate-garmin", with: ["playwright"]
npm "openclaw"
npm "perplexity-web-mcp"
npm "pnpm"
npm "port-whisperer"
npm "strava-mcp-codex"
npm "uipro-cli"
npm "vercel"
