[
  "obsidian-book-search-plugin",
  "mononote",
  "terminal",
  "bettercanvas-view",
  "obsidian-shellcommands",
  "obsidian-hider",
  "code-styler",
  "obsidian-icon-folder",
  "obsidian-style-settings",
  "shrink-pinned-tabs"
]